package Step;


import java.util.HashMap;
import java.util.Map;
import java.util.Scanner;

public class metodi {
    public static void metod1(int ar[]) {
        /*
        7.	Написать 4 метода, которые позволят: вернуть ссылку на созданный одномерный массив типа int указанного размера,
        заполнить массив случайными числами, показать массив на экран консоли, отсортировать массив, вставить целое
         число в указанный массив типа int по указанному индексу.
*/
    }


    public static void main(String[] args) {
        //arrayAvg(new int[]{1, 2, 3, 4, 5});
    }
}




/*
        8.	Написать статический метод, показывающий на экран минимум и максимум (значение и индекс) среди элементов передаваемого ему массива.

/*
        9.	Написать статический метод, меняющий порядок следования элементов передаваемого ему массива на противоположный.

/*
        10.	Есть два игральных кубика со значениями от 1 до 6. Игра происходит с компьютером, кубики бросаются поочерёдно.
         Побеждает тот, у кого сумма выпавших очков по итогам пяти бросков больше.
         Кубики отображаются при помощи псевдографики. В конце игры необходимо вывести среднее арифметическое по броскам для обоих соперников.

/*
        11.	 Написать статический метод myRound для округления заданного числа до указанного количества знаков после запятой.
        Метод возвращает полученное число.

/*
        12.	Оптимизировать коды решений по одиннадцатому блоку (введение в Java FX).
         В новой версии проекта «Лабиринт» должно получиться не менее 20 пользовательских методов.
*/
